In [2]:
from pandas import DataFrame,Series
import pandas as pd
import numpy as np

In [4]:
#Data Aggregation and Group Operations

In [5]:
df = DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5),'data2' : np.random.randn(5)})

In [6]:
df

  key1 key2     data1     data2
0    a  one -2.580936  1.291282
1    a  two  0.997572  0.962145
2    b  one  1.043134 -0.880254
3    b  two  0.195510 -3.179224
4    a  one  1.564097 -0.552578

In [9]:
grouped = df['data1'].groupby(df['key1'])
grouped.mean()

key1
a   -0.006422
b    0.619322
Name: data1, dtype: float64

In [10]:
grouped = df['data2'].groupby(df['key2'])
grouped.mean()

key2
one   -0.047184
two   -1.108539
Name: data2, dtype: float64

In [11]:
means=grouped = df['data1'].groupby(df['key1']).mean()

In [13]:
means

key1
a   -0.006422
b    0.619322
Name: data1, dtype: float64

In [15]:
#means.unstack()

In [16]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [17]:
for name, group in df.groupby('key1'):
    print (name)
    print (group)

a
  key1 key2     data1     data2
0    a  one -2.580936  1.291282
1    a  two  0.997572  0.962145
4    a  one  1.564097 -0.552578
b
  key1 key2     data1     data2
2    b  one  1.043134 -0.880254
3    b  two  0.195510 -3.179224

In [18]:
people = DataFrame(np.random.randn(5, 5),columns=['a', 'b', 'c', 'd', 'e'],index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe     0.667024 -1.707716  0.885326  2.153892 -0.771466
Steve  -0.963397 -0.062125  0.782281 -0.295930  0.143002
Wes    -0.770408 -0.634251 -0.245321  0.327499  1.027709
Jim     0.502496 -1.135240  0.299755 -1.145517 -1.046237
Travis  0.128823  0.161133  1.414282 -1.220761  1.435761

In [19]:
people.ix[2:3, ['b', 'c']] = np.nan

C:\Users\DeLL\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [20]:
people

               a         b         c         d         e
Joe     0.667024 -1.707716  0.885326  2.153892 -0.771466
Steve  -0.963397 -0.062125  0.782281 -0.295930  0.143002
Wes    -0.770408       NaN       NaN  0.327499  1.027709
Jim     0.502496 -1.135240  0.299755 -1.145517 -1.046237
Travis  0.128823  0.161133  1.414282 -1.220761  1.435761

In [21]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue','d': 'blue', 'e': 'red', 'f' : 'orange'}

In [22]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     3.039218 -1.812157
Steve   0.486351 -0.882520
Wes     0.327499  0.257301
Jim    -0.845761 -1.678982
Travis  0.193521  1.725717

In [24]:
map_series = Series(mapping)
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [25]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.399112 -2.842956  1.185081  1.335875 -0.789995
5 -0.963397 -0.062125  0.782281 -0.295930  0.143002
6  0.128823  0.161133  1.414282 -1.220761  1.435761